<a href="https://colab.research.google.com/github/salsaimon/proyecto_recursoshumanos/blob/main/GH_preprocesamiento.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [18]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [23]:
#### Cargar paquetes siempre al inicio
import pandas as pd ### para manejo de datos
import sqlite3 as sql #### para bases de datos sql
import sys ## saber ruta de la que carga paquetes

In [24]:

import sys
import os

path='/content/drive/MyDrive/analitica3win/proyecto_recursoshumanos'

os.chdir(path) ### setting a Working directory on drive path
sys.path.append(path+'/')  ###setting path to read user defined functions

import a_funciones as funciones  ###archivo de funciones propias

In [25]:
####################################################################################################################
########################  1. Comprender y limpiar datos ##################################################################
####################################################################################################################
########   Verificar lectura correcta de los datos
########   Verificar Datos faltantes (eliminar variables si es necesario) (la imputación está la parte de modelado)
########   Tipos de variables (categoricas/numéricas/fechas)
########   Niveles en categorícas
########   Observaciones por categoría
########   Datos atípicos en numéricas

In [26]:
##leer bases de datos

retiros=pd.read_csv('data/retirement_info.csv')
general=pd.read_csv('data/general_data.csv')
employee_survey=pd.read_csv('data/employee_survey_data.csv')
manager_survey=pd.read_csv('data/manager_survey.csv')

#crear df para cada base
df_retiros= retiros
df_general= general
df_employee= employee_survey
df_manager= manager_survey

###### Verificar lectura correcta de los datos
df_retiros.sort_values(by=['EmployeeID'],ascending=1).head(100)
df_general.sort_values(by=['EmployeeID'],ascending=1).head(100)
df_employee.sort_values(by=['EmployeeID'],ascending=1).head(100)
df_manager.sort_values(by=['EmployeeID'],ascending=1).head(100)

      EmployeeID  JobInvolvement  PerformanceRating  SurveyDate
0              1               3                  3  2015-12-31
4410           1               3                  3  2016-12-31
1              2               2                  4  2015-12-31
2              3               3                  3  2015-12-31
4412           3               3                  3  2016-12-31
...          ...             ...                ...         ...
4461          52               2                  3  2016-12-31
51            52               2                  3  2015-12-31
4462          53               3                  4  2016-12-31
52            53               3                  4  2015-12-31
53            54               3                  3  2015-12-31

[100 rows x 4 columns]

In [27]:

##### resumen con información tablas faltantes y tipos de variables y hacer correcciones
df_retiros.info(verbose=True)
df_general.info(verbose=True)
df_employee.info(verbose=True)
df_manager.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 711 entries, 0 to 710
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         711 non-null    int64
 1   Attrition          711 non-null    object
 2   retirementDate     711 non-null    object
 3   retirementType     711 non-null    object
 4   resignationReason  641 non-null    object
dtypes: int64(1), object(4)
memory usage: 27.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8820 entries, 0 to 8819
Data columns (total 24 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      8820 non-null   int64
 1   BusinessTravel           8820 non-null   object
 2   Department               8820 non-null   object
 3   DistanceFromHome         8820 non-null   int64
 4   Education                8820 non-null   int64
 5   EducationField           8820 non-null   object
 6   EmployeeCount            8820 non-null   int64
 7   EmployeeID               8820 non-null   int64
 8   Gender                   8820 non-null   object
 9   JobLevel                 8820 non-null   int64
 10  JobRole                  8820 non-null   object
 11  MaritalStatus            8820 non-null   object
 12  MonthlyIncome            8820 non-null   int64
 13  NumCompaniesWorked       8782 non-null   float64
 14  Over18                   8820 non-null   object
 15  PercentSalaryHike        8820 non-null   int64
 16  StandardHours            8820 non-null   int64
 17  StockOptionLevel         8820 non-null   int64
 18  TotalWorkingYears        8802 non-null   float64
 19  TrainingTimesLastYear    8820 non-null   int64
 20  YearsAtCompany           8820 non-null   int64
 21  YearsSinceLastPromotion  8820 non-null   int64
 22  YearsWithCurrManager     8820 non-null   int64
 23  InfoDate                 8820 non-null   object
dtypes: float64(2), int64(14), object(8)
memory usage: 1.6+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8820 entries, 0 to 8819
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   EmployeeID               8820 non-null   int64
 1   EnvironmentSatisfaction  8770 non-null   float64
 2   JobSatisfaction          8780 non-null   float64
 3   WorkLifeBalance          8744 non-null   float64
 4   DateSurvey               8820 non-null   object
dtypes: float64(3), int64(1), object(1)
memory usage: 344.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8820 entries, 0 to 8819
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         8820 non-null   int64
 1   JobInvolvement     8820 non-null   int64
 2   PerformanceRating  8820 non-null   int64
 3   SurveyDate         8820 non-null   object
dtypes: int64(3), object(1)
memory usage: 275.8+ KB

In [28]:
#### Convertir campos a formato fecha
df_retiros["retirementDate"]=pd.to_datetime(df_retiros['retirementDate'], format="%Y-%m-%d")
df_general["InfoDate"]=pd.to_datetime(df_general['InfoDate'], format="%Y-%m-%d")
df_employee["DateSurvey"]=pd.to_datetime(df_employee['DateSurvey'], format="%Y-%m-%d")
df_manager["SurveyDate"]=pd.to_datetime(df_manager['SurveyDate'], format="%Y-%m-%d")

In [29]:
#### convertir a categórica

#general
df_general=df_general.astype({'Education': object,'JobLevel': object,'StockOptionLevel': object})
#employee
df_employee=df_employee.astype({'EnvironmentSatisfaction': object,'JobSatisfaction': object,'WorkLifeBalance': object})
#manager
df_manager=df_manager.astype({'JobInvolvement': object,'PerformanceRating': object})

In [30]:
###Eliminar columnas que no se utilicen
#eliminar over 18 de general
df_general=df_general.drop(["Over18"], axis=1)

In [31]:
conn=sql.connect('base.db')  ### crea base de datos
cur=conn.cursor()  ### para ejecutar consultas en la base de datos

In [32]:
### Llevar tablas a base de datos
df_retiros.to_sql("retiros",conn,if_exists="replace")
df_general.to_sql("general",conn,if_exists="replace")
df_employee.to_sql("employee",conn,if_exists="replace")
df_manager.to_sql("manager",conn,if_exists="replace")

cur.execute("Select name from sqlite_master where type='table'") ### consultar bases de datos
cur.fetchall()

[('retiros',), ('general',), ('employee',), ('manager',)]

In [33]:
##### verificar categorías y observaciones ######
#####El número de categorías de una variable influye mucho en la eficiencia y sobre ajuste#
### convertir tabla de base de datos en data frame de pandas y hacer consultas ####

#############################RETIROS

pd.read_sql("""select Attrition,count(*)
                            from retiros
                            group by Attrition""", conn)

#recategorizar 0 y 1
pd.read_sql("""select retirementType,count(*)
                            from retiros
                            group by retirementType""", conn)

#recategorizar, tiene 4 categorias
pd.read_sql("""select resignationReason,count(*)
                            from retiros
                            group by resignationReason""", conn)

#############################GENERAL
#recategorizar, 3 categorias
pd.read_sql("""select BusinessTravel,count(*)
                            from general
                            group by BusinessTravel""", conn)

#recategorizar, 3 categorias
pd.read_sql("""select Department,count(*)
                            from general
                            group by Department""", conn)

#recategorizar, 4 categorias
pd.read_sql("""select Education,count(*)
                            from general
                            group by Education""", conn)

#recategorizar, 5 categorias posible eliminacion
pd.read_sql("""select EducationField,count(*)
                            from general
                            group by EducationField""", conn)

#recategorizar, 5 categorias
pd.read_sql("""select  JobLevel,count(*)
                            from general
                            group by  JobLevel""", conn)

#recategorizar, 8 categorias, agrupar primero y luego categorizar
pd.read_sql("""select  JobRole,count(*)
                            from general
                            group by  JobRole""", conn)

#recategorizar, 3 categorias posible eliminacion
pd.read_sql("""select  MaritalStatus,count(*)
                            from general
                            group by  MaritalStatus""", conn)

#recategorizar, 4 categorias
pd.read_sql("""select  StockOptionLevel,count(*)
                            from general
                            group by  StockOptionLevel""", conn)


#############################EMPLOYEE
#recategorizar, 4 categorias
pd.read_sql("""select  EnvironmentSatisfaction,count(*)
                            from employee
                            group by  EnvironmentSatisfaction""", conn)

#recategorizar, 5 categorias
pd.read_sql("""select  JobSatisfaction,count(*)
                            from employee
                            group by  JobSatisfaction""", conn)

#recategorizar, 5 categorias
pd.read_sql("""select  WorkLifeBalance,count(*)
                            from employee
                            group by  WorkLifeBalance""", conn)


#############################MANAGER

#recategorizar, 4 categorias
pd.read_sql("""select  JobInvolvement,count(*)
                            from manager
                            group by  JobInvolvement""", conn)

#recategorizar, 2 categorias 0y 1
pd.read_sql("""select  PerformanceRating,count(*)
                            from manager
                            group by  PerformanceRating""", conn)

   PerformanceRating  count(*)
0                  3      7464
1                  4      1356

In [35]:
def procesar_script_sql(file_path, cursor):
    # Verificar si el archivo existe
    if not os.path.isfile(file_path):
        # Si el archivo no existe, créalo como un archivo vacío
        with open(file_path, 'w') as f:
            pass
        print(f"Archivo {file_path} creado porque no existía.")
        return

    # Leer el contenido del archivo SQL
    with open(file_path, 'r') as file:
        sql_script = file.read()

    # Verificar que el contenido no esté vacío
    if sql_script.strip():
        try:
            cursor.executescript(sql_script)
            print(f"Ejecutado el script SQL: {file_path}")
        except sql.Error as e:
            print(f"Error al ejecutar el script SQL: {e}")
    else:
        print(f"El archivo {file_path} está vacío.")

    # Consultar las tablas en la base de datos
    cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
    print("Tablas en la base de datos:")
    print(cursor.fetchall())

# Ruta del archivo SQL
file_path = 'preprocesamientos.sql'

# Procesar el archivo SQL
procesar_script_sql(file_path, cur)

El archivo preprocesamientos.sql está vacío.
Tablas en la base de datos:
[('retiros',), ('general',), ('employee',), ('manager',)]

In [39]:
import pandas as pd
import sqlite3 as sql
import sys
import os

# Función para exportar la base de datos SQLite a un archivo SQL
def exportar_sqlite_a_sql(db_path, sql_file_path):
    conn = sql.connect(db_path)
    cursor = conn.cursor()

    with open(sql_file_path, 'w') as f:
        for line in conn.iterdump():
            # Reemplazar tipos de datos específicos de SQLite por los de MySQL
            line = line.replace('INTEGER PRIMARY KEY AUTOINCREMENT', 'INT AUTO_INCREMENT PRIMARY KEY')
            line = line.replace('AUTOINCREMENT', '')  # SQLite AUTOINCREMENT no es necesario en MySQL

            # Reemplazar BEGIN TRANSACTION y COMMIT por los equivalentes de MySQL
            line = line.replace('BEGIN TRANSACTION;', 'START TRANSACTION;')
            line = line.replace('COMMIT;', 'COMMIT;')

            # Reemplazar PRAGMA por comentarios en MySQL
            line = line.replace('PRAGMA', '-- PRAGMA')

            # Reemplazar comillas dobles por comillas invertidas
            line = line.replace('"', '`')

            f.write(f'{line}\n')

    conn.close()
    print(f"Base de datos exportada a {sql_file_path}")

# Rutas de archivo
db_path = 'base.db'
sql_file_path = 'preprocesamientos.sql'

# Exportar la base de datos SQLite a un archivo SQL
exportar_sqlite_a_sql(db_path, sql_file_path)

# Para verificar el contenido del archivo SQL
def verificar_contenido_sql(file_path):
    if os.path.isfile(file_path):
        with open(file_path, 'r') as file:
            contenido = file.read()
            if contenido:
                print("Contenido del archivo SQL:")
                print(contenido)
            else:
                print(f"El archivo {file_path} está vacío.")
    else:
        print(f"El archivo {file_path} no existe.")

# Verificar el contenido del archivo SQL
verificar_contenido_sql(sql_file_path)

Base de datos exportada a preprocesamientos.sql
Contenido del archivo SQL:
START TRANSACTION;
CREATE TABLE `employee` (
`index` INTEGER,
  `EmployeeID` INTEGER,
  `EnvironmentSatisfaction` REAL,
  `JobSatisfaction` REAL,
  `WorkLifeBalance` REAL,
  `DateSurvey` TIMESTAMP
);
INSERT INTO `employee` VALUES(0,1,3.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(1,2,3.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(2,3,2.0,2.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(3,4,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(4,5,4.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(5,6,3.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(6,7,1.0,3.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(7,8,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(8,9,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(9,10,2.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(10,11,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(11,12,NULL,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(12,13,4.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(13,14,1.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(14,15,4.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(15,16,3.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(16,17,4.0,3.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(17,18,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(18,19,2.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(19,20,1.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(20,21,3.0,2.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(21,22,1.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(22,23,3.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(23,24,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(24,25,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(25,26,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(26,27,1.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(27,28,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(28,29,4.0,3.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(29,30,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(30,31,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(31,32,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(32,33,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(33,34,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(34,35,4.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(35,36,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(36,37,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(37,38,3.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(38,39,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(39,40,3.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(40,41,3.0,NULL,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(41,42,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(42,43,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(43,44,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(44,45,2.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(45,46,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(46,47,3.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(47,48,2.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(48,49,4.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(49,50,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(50,51,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(51,52,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(52,53,1.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(53,54,1.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(54,55,3.0,4.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(55,56,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(56,57,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(57,58,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(58,59,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(59,60,3.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(60,61,3.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(61,62,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(62,63,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(63,64,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(64,65,1.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(65,66,1.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(66,67,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(67,68,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(68,69,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(69,70,4.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(70,71,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(71,72,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(72,73,3.0,3.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(73,74,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(74,75,4.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(75,76,3.0,1.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(76,77,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(77,78,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(78,79,2.0,1.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(79,80,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(80,81,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(81,82,2.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(82,83,4.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(83,84,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(84,85,3.0,4.0,NULL,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(85,86,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(86,87,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(87,88,3.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(88,89,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(89,90,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(90,91,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(91,92,4.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(92,93,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(93,94,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(94,95,1.0,3.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(95,96,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(96,97,4.0,3.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(97,98,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(98,99,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(99,100,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(100,101,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(101,102,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(102,103,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(103,104,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(104,105,1.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(105,106,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(106,107,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(107,108,3.0,3.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(108,109,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(109,110,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(110,111,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(111,112,NULL,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(112,113,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(113,114,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(114,115,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(115,116,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(116,117,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(117,118,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(118,119,3.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(119,120,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(120,121,1.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(121,122,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(122,123,4.0,3.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(123,124,3.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(124,125,3.0,NULL,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(125,126,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(126,127,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(127,128,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(128,129,4.0,1.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(129,130,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(130,131,2.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(131,132,3.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(132,133,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(133,134,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(134,135,1.0,1.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(135,136,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(136,137,2.0,1.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(137,138,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(138,139,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(139,140,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(140,141,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(141,142,4.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(142,143,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(143,144,3.0,1.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(144,145,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(145,146,2.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(146,147,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(147,148,1.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(148,149,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(149,150,1.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(150,151,4.0,4.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(151,152,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(152,153,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(153,154,1.0,1.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(154,155,3.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(155,156,4.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(156,157,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(157,158,4.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(158,159,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(159,160,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(160,161,1.0,4.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(161,162,3.0,4.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(162,163,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(163,164,3.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(164,165,1.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(165,166,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(166,167,1.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(167,168,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(168,169,3.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(169,170,3.0,1.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(170,171,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(171,172,1.0,3.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(172,173,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(173,174,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(174,175,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(175,176,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(176,177,3.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(177,178,2.0,3.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(178,179,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(179,180,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(180,181,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(181,182,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(182,183,2.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(183,184,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(184,185,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(185,186,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(186,187,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(187,188,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(188,189,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(189,190,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(190,191,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(191,192,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(192,193,2.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(193,194,4.0,1.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(194,195,4.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(195,196,NULL,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(196,197,4.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(197,198,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(198,199,3.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(199,200,2.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(200,201,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(201,202,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(202,203,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(203,204,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(204,205,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(205,206,3.0,4.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(206,207,2.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(207,208,1.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(208,209,2.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(209,210,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(210,211,4.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(211,212,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(212,213,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(213,214,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(214,215,2.0,2.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(215,216,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(216,217,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(217,218,1.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(218,219,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(219,220,1.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(220,221,2.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(221,222,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(222,223,2.0,1.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(223,224,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(224,225,2.0,1.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(225,226,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(226,227,1.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(227,228,1.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(228,229,4.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(229,230,4.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(230,231,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(231,232,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(232,233,3.0,1.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(233,234,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(234,235,4.0,1.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(235,236,1.0,3.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(236,237,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(237,238,3.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(238,239,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(239,240,4.0,4.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(240,241,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(241,242,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(242,243,1.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(243,244,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(244,245,4.0,1.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(245,246,2.0,4.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(246,247,1.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(247,248,3.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(248,249,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(249,250,2.0,3.0,2.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(250,251,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(251,252,3.0,4.0,1.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(252,253,3.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(253,254,2.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(254,255,1.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(255,256,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(256,257,1.0,1.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(257,258,3.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(258,259,1.0,1.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(259,260,4.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(260,261,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(261,262,2.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(262,263,2.0,2.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(263,264,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(264,265,4.0,4.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(265,266,4.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(266,267,4.0,2.0,4.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(267,268,1.0,3.0,3.0,'2015-12-31 00:00:00');
INSERT INTO `employee` VALUES(268,269,4.0,3.0,3.0,'2015-12-31 00:00:00');